Autodesk.Revit.UI.DetachFromCentralOptionForUI
Options for workset detachment behavior.
Since:
2013

Autodesk.Revit.UI.DetachFromCentralOptionForUI.DetachAndPrompt
Detach the file being opened from its central file and prompt the user to preserve or discard worksets.

Autodesk.Revit.UI.DetachFromCentralOptionForUI.DetachAndPreserveWorksets
Detach the file being opened from its central file and preserve worksets.

Autodesk.Revit.UI.DetachFromCentralOptionForUI.DoNotDetach
Do not detach the file being opened from its central file.